# SystemEquipmentSets Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..SystemEquipmentSets Property
ParameterTypeId Class See Also
---
"Equipment Sets"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId SystemEquipmentSets { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SystemEquipmentSets As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ SystemEquipmentSets {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace